SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# WDT MODE                               #
#________________________________________#
avrdd.menu.WDTtimeout.disabled=Disabled (recommended)
avrdd.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
avrdd.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
avrdd.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
avrdd.menu.WDTtimeout.1second=Window remains open for 1 Second
avrdd.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
avrdd.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
avrdd.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
avrdd.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
avrdd.menu.WDTwindow.disabled=No delay before window "opens"
avrdd.menu.WDTwindow.8seconds=8 Second before window "opens"
avrdd.menu.WDTwindow.4seconds=4 Second before window "opens"
avrdd.menu.WDTwindow.2seconds=2 Second before window "opens"
avrdd.menu.WDTwindow.1second=1 Second before window "opens"
avrdd.menu.WDTwindow.500msec=500 millisecond before window "opens"
avrdd.menu.WDTwindow.250msec=250 millisecond before window "opens"
avrdd.menu.WDTwindow.125msec=125 millisecond before window "opens"
avrdd.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
avrdd.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
avrdd.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
avrdd.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
avrdd.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
avrdd.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
avrdd.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
avrdd.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
avrdd.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
avrdd.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
avrdd.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
avrdd.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
avrdd.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
avrdd.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
avrdd.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
avrdd.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
avrdd.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
avrdd.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
avrdd.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

#----------------------------------------#
# Flash Mapping options                  #
#________________________________________#
avrdd.menu.flmap.lockdefault=Use last FLMAP section, lock FLMAP, provide PROGMEM_MAPPED
avrdd.menu.flmap.unlocked=Start w/default, do not lock flmap. No PROGMEM_MAPPED.
avrdd.menu.flmap.locksection0=Set FLMAP to section 0, lock FLMAP, provide PROGMEM_MAPPED
avrdd.menu.flmap.lockdefault.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION1
avrdd.menu.flmap.unlocked.build.flmapopts=
avrdd.menu.flmap.locksection0.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION0
avrdd.menu.flmap.lockdefault.build.flmapabr=.fld
avrdd.menu.flmap.unlocked.build.flmapabr=.ful
avrdd.menu.flmap.locksection0.build.flmapabr=.fl0



##########################################################################
#                                                                        #
###                 ###  #     # ####      ####  #   #                 ###
#####              #   # #     # #   #     #   # #   #               #####
#######            #####  #   #  ####  ### #   # #   #             #######
#####              #   #   # #   # #       #   # #   #               #####
###                #   #    #    #  #      ####   ###                  ###
#________________________________________________________________________#
#                                        #
# Parameters and defaults for DD parts   #
#________________________________________#
avrdu.upload.tool=avrdude
avrdu.upload.prog_interlock=
avrdu.build.board=avrdu
avrdu.build.core=dxcore
avrdu.upload.maximum_size=0
avrdu.upload.maximum_data_size=0
# The maximum size and data size attributes are overridden by the selected chip. If you are avoiding specifying that somehow, there is no hope of anything working, so don't do that.
# Each top-level entry supports at least a dozen parts with varying memory constraints.
avrdu.build.f_cpu={build.speed}000000L
avrdu.build.text_section_start=.text=0x0
avrdu.build.defaultswaps=
avrdu.build.extra_flags= {bootloader.appspm} {build.defaultswaps}
avrdu.build.export_merged_output=false
avrdu.build.highestcb=B2
avrdu.build.printf=
avrdu.build.flmapopts=
avrdu.build.attachmode=-DCORE_ATTACH_ALL

#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
avrdu.bootloader.tool=avrdude
avrdu.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
avrdu.bootloader.wdtwindowbits=0000
avrdu.bootloader.wdttimeotbits=0000
avrdu.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrdu.bootloader.updipinbit=1
avrdu.bootloader.SYSCFG0=0b110{bootloader.updipinbit}{bootloader.resetpinbits}00{bootloader.eesavebit}
avrdu.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
avrdu.bootloader.CODESIZE=0x00
avrdu.bootloader.BOOTSIZE=0x01
avrdu.bootloader.avrdudestring=
avrdu.bootloader.pymcuprogstring=-aerase

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
avrdu.build.mcupostfix=
avrdu.build.printfabr=
avrdu.build.flmapabr=.ful
avrdu.build.attachabr=
avrdu.build.wireabr=
avrdu.build.appspmabr=.spm{bootloader.CODESIZE}

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DU submenu options                     #
#____________________________________________#
# Chip (memory and pincount)             #
# 14/20-pin parts get default millis     #
# changed just like tinyAVRs do          #
#________________________________________#
avrdu.menu.chip.avr64du32=AVR64DU32
avrdu.menu.chip.avr64du28=AVR64DU28
avrdu.menu.chip.avr32du32=AVR32DU32
avrdu.menu.chip.avr32du28=AVR32DU28
avrdu.menu.chip.avr32du20=AVR32DU20
avrdu.menu.chip.avr32du14=AVR32DU14
avrdu.menu.chip.avr16du32=AVR16DU32
avrdu.menu.chip.avr16du28=AVR16DU28
avrdu.menu.chip.avr16du20=AVR16DU20
avrdu.menu.chip.avr16du14=AVR16DU14
avrdu.menu.chip.avr64du32.build.mcu=avr64du32
avrdu.menu.chip.avr64du32.upload.maximum_size=65536
avrdu.menu.chip.avr64du32.upload.maximum_data_size=8192
avrdu.menu.chip.avr64du32.build.variant=32pin-duseries
avrdu.menu.chip.avr64du32.build.highestcb=B2
avrdu.menu.chip.avr64du28.build.mcu=avr64du28
avrdu.menu.chip.avr64du28.upload.maximum_size=65536
avrdu.menu.chip.avr64du28.upload.maximum_data_size=8192
avrdu.menu.chip.avr64du28.build.variant=28pin-duseries
avrdu.menu.chip.avr32du32.build.mcu=avr32du32
avrdu.menu.chip.avr32du32.upload.maximum_size=32768
avrdu.menu.chip.avr32du32.upload.maximum_data_size=4096
avrdu.menu.chip.avr32du32.build.variant=32pin-duseries
avrdu.menu.chip.avr32du28.build.mcu=avr32du28
avrdu.menu.chip.avr32du28.upload.maximum_size=32768
avrdu.menu.chip.avr32du28.upload.maximum_data_size=4096
avrdu.menu.chip.avr32du28.build.variant=28pin-duseries
avrdu.menu.chip.avr32du20.build.mcu=avr32du20
avrdu.menu.chip.avr32du20.upload.maximum_size=32768
avrdu.menu.chip.avr32du20.upload.maximum_data_size=4096
avrdu.menu.chip.avr32du20.build.highestcb=B1
avrdu.menu.chip.avr32du20.build.variant=20pin-duseries
avrdu.menu.chip.avr32du20.build.defaultswaps=-DMUX_DEFAULT_USART1=2
avrdu.menu.chip.avr32du14.build.mcu=avr32du14
avrdu.menu.chip.avr32du14.upload.maximum_size=32768
avrdu.menu.chip.avr32du14.upload.maximum_data_size=4096
avrdu.menu.chip.avr32du14.build.highestcb=B1
avrdu.menu.chip.avr32du14.build.variant=14pin-duseries
avrdu.menu.chip.avr32du14.build.defaultswaps=-DMUX_DEFAULT_USART1=2
avrdu.menu.chip.avr16du32.build.mcu=avr16du32
avrdu.menu.chip.avr16du32.upload.maximum_size=16384
avrdu.menu.chip.avr16du32.upload.maximum_data_size=2048
avrdu.menu.chip.avr16du32.build.variant=32pin-duseries
avrdu.menu.chip.avr16du28.build.mcu=avr16du28
avrdu.menu.chip.avr16du28.upload.maximum_size=16384
avrdu.menu.chip.avr16du28.upload.maximum_data_size=2048
avrdu.menu.chip.avr16du28.build.variant=28pin-duseries
avrdu.menu.chip.avr16du20.build.mcu=avr16du20
avrdu.menu.chip.avr16du20.upload.maximum_size=16384
avrdu.menu.chip.avr16du20.upload.maximum_data_size=2048
avrdu.menu.chip.avr16du20.build.highestcb=B1
avrdu.menu.chip.avr16du20.build.variant=20pin-duseries
avrdu.menu.chip.avr16du20.build.defaultswaps=-DMUX_DEFAULT_USART1=2
avrdu.menu.chip.avr16du14.build.mcu=avr16du14
avrdu.menu.chip.avr16du14.upload.maximum_size=16384
avrdu.menu.chip.avr16du14.upload.maximum_data_size=2048
avrdu.menu.chip.avr16du14.build.highestcb=B1
avrdu.menu.chip.avr16du14.build.variant=14pin-duseries
avrdu.menu.chip.avr16du14.build.defaultswaps=-DMUX_DEFAULT_USART1=2

