SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Clock speed and source options         #
#________________________________________#
avrdu.menu.clock.24internal=24 MHz internal
avrdu.menu.clock.24internal.build.speed=24
avrdu.menu.clock.24internal.build.clocksource=0
avrdu.menu.clock.20internal=20 MHz internal
avrdu.menu.clock.20internal.build.speed=20
avrdu.menu.clock.20internal.build.clocksource=0
avrdu.menu.clock.16internal=16 MHz internal
avrdu.menu.clock.16internal.build.speed=16
avrdu.menu.clock.16internal.build.clocksource=0
avrdu.menu.clock.12internal=12 MHz internal
avrdu.menu.clock.12internal.build.speed=12
avrdu.menu.clock.12internal.build.clocksource=0
avrdu.menu.clock.24crystal=24 MHz crystal
avrdu.menu.clock.24crystal.build.speed=24
avrdu.menu.clock.24crystal.build.clocksource=1
avrdu.menu.clock.20crystal=20 MHz crystal
avrdu.menu.clock.20crystal.build.speed=20
avrdu.menu.clock.20crystal.build.clocksource=1
avrdu.menu.clock.16crystal=16 MHz crystal
avrdu.menu.clock.16crystal.build.speed=16
avrdu.menu.clock.16crystal.build.clocksource=1
avrdu.menu.clock.12crystal=12 MHz crystal
avrdu.menu.clock.12crystal.build.speed=12
avrdu.menu.clock.12crystal.build.clocksource=1

#----------------------------------------#
# BrownOut detection (BOD) options       #
#________________________________________#
avrdu.menu.bodvoltage.1v9=1.9V
avrdu.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdu.menu.bodvoltage.2v45=2.45V
avrdu.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdu.menu.bodvoltage.2v70=2.70V
avrdu.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdu.menu.bodvoltage.2v85=2.85V
avrdu.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdu.menu.bodmode.disabled=Disabled/Disabled
avrdu.menu.bodmode.enabled=Enabled/Enabled
avrdu.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
avrdu.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
avrdu.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
avrdu.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
avrdu.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
avrdu.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
avrdu.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrdu.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrdu.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrdu.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrdu.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrdu.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrdu.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
avrdu.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrdu.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrdu.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100


#----------------------------------------#
# Reset pin as input option              #
#________________________________________#
avrdu.menu.resetpin.reset=Hardware Reset (recommended)
avrdu.menu.resetpin.reset.bootloader.resetpinbit=1
avrdu.menu.resetpin.input=Input (no output, ever)
avrdu.menu.resetpin.input.bootloader.resetpinbit=0

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
avrdu.menu.millis.tcbhighest=Default (recommended)
avrdu.menu.millis.disabled=Disabled (delay() only)
avrdu.menu.millis.tcb0=TCB0
avrdu.menu.millis.tcb1=TCB1 (default)
avrdu.menu.millis.tca0=TCA0
avrdu.menu.millis.tcbhighest.build.millistimer=B1
avrdu.menu.millis.tcb0.build.millistimer=B0
avrdu.menu.millis.tcb1.build.millistimer=B1
avrdu.menu.millis.tca0.build.millistimer=A0
avrdu.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
avrdu.menu.printf.default=Default, 1.5k flash, no floats
avrdu.menu.printf.full=Full, 2.6k, prints floats
avrdu.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrdu.menu.printf.full.build.printfabr=.pfF
avrdu.menu.printf.minimal=Minimal, 1.1k flash used
avrdu.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrdu.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#avrdu.menu.optimization.size=-Os (size)
#avrdu.menu.optimization.sizegcse=-Os (size, no GCSE)
#avrdu.menu.optimization.o3=-O3 (speed)
#avrdu.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#avrdu.menu.optimization.size.build.optimizationlevel=-Os
#avrdu.menu.optimization.sizegcse.build.optimizationlevel=-Os
#avrdu.menu.optimization.o3.build.optimizationlevel=-O3
#avrdu.menu.optimization.o3gcse.build.optimizationlevel=-O3
#avrdu.menu.optimization.size.build.optabr=.Os
#avrdu.menu.optimization.sizegcse.build.optabr=.Osng
#avrdu.menu.optimization.o3.build.optabr=.O3
#avrdu.menu.optimization.o3gcse.build.optabr=.O3ng
#avrdu.menu.optimization.sizegcse.build.gcse=-fno-gcse
#avrdu.menu.optimization.o3gcse.build.gcse=-fno-gcse


#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
avrdu.menu.attach.allenabled=On all pins, with new implementation.
avrdu.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avrdu.menu.attach.manual=Only enabled ports. Please see documentation.
avrdu.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avrdu.menu.attach.oldversion=Old version, may fix bugs.
avrdu.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
avrdu.menu.attach.manual.build.attachabr=.aMan
avrdu.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# Startup time options                   #
#________________________________________#
avrdu.menu.startuptime.8=8ms
avrdu.menu.startuptime.0=0ms
avrdu.menu.startuptime.1=1ms
avrdu.menu.startuptime.2=2ms
avrdu.menu.startuptime.4=4ms
avrdu.menu.startuptime.16=16ms
avrdu.menu.startuptime.32=32ms
avrdu.menu.startuptime.64=64ms
avrdu.menu.startuptime.0.bootloader.sutbits=000
avrdu.menu.startuptime.1.bootloader.sutbits=001
avrdu.menu.startuptime.2.bootloader.sutbits=010
avrdu.menu.startuptime.4.bootloader.sutbits=011
avrdu.menu.startuptime.8.bootloader.sutbits=100
avrdu.menu.startuptime.16.bootloader.sutbits=101
avrdu.menu.startuptime.32.bootloader.sutbits=110
avrdu.menu.startuptime.64.bootloader.sutbits=111

#-------------------------------------#
#         Wire Mode Selection         #
#     To enable master+slave mode     #
#_____________________________________#
avrdu.menu.wiremode.mors= Master or Slave
avrdu.menu.wiremode.mors.build.wiremode=MORS_SINGLE
avrdu.menu.wiremode.mors.build.wireabr=.wO
avrdu.menu.wiremode.mands=Master and Slave
avrdu.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
avrdu.menu.wiremode.mands.build.wireabr=.wA

#-------------------------------------#
#         SPM from app mode           #
# To enable writing flash from app    #
#_____________________________________#
avrdu.menu.appspm.no=Disabled (Always use this if not writing flash from app)
avrdu.menu.appspm.no.bootloader.appspm=
avrdu.menu.appspm.no.bootloader.BOOTSIZE=0x00
avrdu.menu.appspm.no.build.appspmabr=
avrdu.menu.appspm.full=Anywhere after 0x0200 (warning: App allowed to overwrite itself)
avrdu.menu.appspm.full.bootloader.appspm=-DSPM_FROM_APP=-1
avrdu.menu.appspm.full.build.appspmabr=.spmALL
avrdu.menu.appspm.8plus=Above 8k (meant for 16k parts)
avrdu.menu.appspm.8plus.bootloader.appspm=-DSPM_FROM_APP=16
avrdu.menu.appspm.8plus.bootloader.CODESIZE=16
avrdu.menu.appspm.12plus=Above 12k (meant for 16k parts)
avrdu.menu.appspm.12plus.bootloader.appspm=-DSPM_FROM_APP=24
avrdu.menu.appspm.12plus.bootloader.CODESIZE=24
avrdu.menu.appspm.14plus=Above 14k (meant for 16k parts)
avrdu.menu.appspm.14plus.bootloader.appspm=-DSPM_FROM_APP=28
avrdu.menu.appspm.14plus.bootloader.CODESIZE=28
avrdu.menu.appspm.16plus=Above 16k (AVR64/32 only, meant for 32k parts)
avrdu.menu.appspm.16plus.bootloader.appspm=-DSPM_FROM_APP=32
avrdu.menu.appspm.16plus.bootloader.CODESIZE=32
avrdu.menu.appspm.24plus=Above 24k (AVR64/32 only, meant for 32k parts)
avrdu.menu.appspm.24plus.bootloader.appspm=-DSPM_FROM_APP=48
avrdu.menu.appspm.24plus.bootloader.CODESIZE=48
avrdu.menu.appspm.28plus=Above 28k (AVR64/32 only, meant for 32k parts)
avrdu.menu.appspm.28plus.bootloader.appspm=-DSPM_FROM_APP=56
avrdu.menu.appspm.28plus.bootloader.CODESIZE=56
avrdu.menu.appspm.32plus=Above 32k (AVR64DU only)
avrdu.menu.appspm.32plus.bootloader.appspm=-DSPM_FROM_APP=64
avrdu.menu.appspm.32plus.bootloader.CODESIZE=64
avrdu.menu.appspm.48plus=Above 48k (AVR64DU only)
avrdu.menu.appspm.48plus.bootloader.appspm=-DSPM_FROM_APP=96
avrdu.menu.appspm.48plus.bootloader.CODESIZE=96
avrdu.menu.appspm.56plus=Above 56k (AVR64DU only)
avrdu.menu.appspm.56plus.bootloader.appspm=-DSPM_FROM_APP=112
avrdu.menu.appspm.56plus.bootloader.CODESIZE=112
avrdu.menu.appspm.60plus=Above 60k (AVR64DU only)
avrdu.menu.appspm.60plus.bootloader.appspm=-DSPM_FROM_APP=120
avrdu.menu.appspm.60plus.bootloader.CODESIZE=120


