SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# BrownOut detection (BOD) option        #
#________________________________________#
avrea.menu.bodvoltage.1v75=1.75V (during programming only)
avrea.menu.bodvoltage.1v75.bootloader.bodlevbits=000
avrea.menu.bodvoltage.1v9=1.9V
avrea.menu.bodvoltage.1v9.bootloader.bodlevbits=001
avrea.menu.bodvoltage.2v6=2.60V
avrea.menu.bodvoltage.2v6.bootloader.bodlevbits=010
avrea.menu.bodvoltage.4v3=4.3V
avrea.menu.bodvoltage.4v3.bootloader.bodlevbits=011
avrea.menu.bodmode.disabled=Disabled/Disabled
avrea.menu.bodmode.enabled=Enabled/Enabled
avrea.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
avrea.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
avrea.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
avrea.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
avrea.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
avrea.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
avrea.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrea.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrea.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrea.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrea.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrea.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrea.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
avrea.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrea.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrea.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# Retain EEPROM (EESAVE)                 #
#________________________________________#
avrea.menu.eesave.enable=EEPROM retained
avrea.menu.eesave.enable.bootloader.eesavebit=1
avrea.menu.eesave.disable=EEPROM not retained
avrea.menu.eesave.disable.bootloader.eesavebit=0


#----------------------------------------#
# Reset pin as input option              #
#________________________________________#
avrea.menu.resetpin.reset=Hardware Reset (recommended)
avrea.menu.resetpin.reset.bootloader.resetpinbit=1
avrea.menu.resetpin.input=Input (no output, ever)
avrea.menu.resetpin.input.bootloader.resetpinbit=0

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
avrea.menu.millis.tcb2=TCB2 (recommended)
avrea.menu.millis.disabled=Disabled
avrea.menu.millis.tcb0=TCB0
avrea.menu.millis.tcb1=TCB1
avrea.menu.millis.tcb3=TCB3
avrea.menu.millis.tca0=TCA0
avrea.menu.millis.tca1=TCA1
#avrea.menu.millis.rtc=RTC (no micros)
#avrea.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. xtal, no micros
#avrea.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. osc no micros
avrea.menu.millis.tcb0.build.millistimer=B0
avrea.menu.millis.tcb1.build.millistimer=B1
avrea.menu.millis.tcb2.build.millistimer=B2
avrea.menu.millis.tcb3.build.millistimer=B3
avrea.menu.millis.tca0.build.millistimer=A0
avrea.menu.millis.tca1.build.millistimer=A1
#avrea.menu.millis.rtc.build.millistimer=RTC
#avrea.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
#avrea.menu.millis.rtcxosc.build.millistimer=RTC_XOSC
avrea.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
avrea.menu.printf.default=Default, 1.5k flash, no floats
avrea.menu.printf.full=Full, 2.6k, prints floats
avrea.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrea.menu.printf.full.build.printfabr=.pfF
avrea.menu.printf.minimal=Minimal, 1.1k flash used
avrea.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrea.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#avrea.menu.optimization.size=-Os (size)
#avrea.menu.optimization.sizegcse=-Os (size, no GCSE)
#avrea.menu.optimization.o3=-O3 (speed)
#avrea.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#avrea.menu.optimization.size.build.optimizationlevel=-Os
#avrea.menu.optimization.sizegcse.build.optimizationlevel=-Os
#avrea.menu.optimization.o3.build.optimizationlevel=-O3
#avrea.menu.optimization.o3gcse.build.optimizationlevel=-O3
#avrea.menu.optimization.size.build.optabr=.Os
#avrea.menu.optimization.sizegcse.build.optabr=.Osng
#avrea.menu.optimization.o3.build.optabr=.O3
#avrea.menu.optimization.o3gcse.build.optabr=.O3ng
#avrea.menu.optimization.sizegcse.build.gcse=-fno-gcse
#avrea.menu.optimization.o3gcse.build.gcse=-fno-gcse


#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
avrea.menu.attach.allenabled=On all pins, with new implementation.
avrea.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avrea.menu.attach.manual=Only enabled ports. Please see documentation.
avrea.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avrea.menu.attach.oldversion=Old version, may fix bugs.
avrea.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
avrea.menu.attach.manual.build.attachabr=.aMan
avrea.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# Startup time options                   #
#________________________________________#
avrea.menu.startuptime.8=8ms
avrea.menu.startuptime.0=0ms
avrea.menu.startuptime.1=1ms
avrea.menu.startuptime.2=2ms
avrea.menu.startuptime.4=4ms
avrea.menu.startuptime.16=16ms
avrea.menu.startuptime.32=32ms
avrea.menu.startuptime.64=64ms
avrea.menu.startuptime.0.bootloader.SYSCFG1=0x00
avrea.menu.startuptime.1.bootloader.SYSCFG1=0x01
avrea.menu.startuptime.2.bootloader.SYSCFG1=0x02
avrea.menu.startuptime.4.bootloader.SYSCFG1=0x03
avrea.menu.startuptime.8.bootloader.SYSCFG1=0x04
avrea.menu.startuptime.16.bootloader.SYSCFG1=0x05
avrea.menu.startuptime.32.bootloader.SYSCFG1=0x06
avrea.menu.startuptime.64.bootloader.SYSCFG1=0x07

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
avrea.menu.wiremode.mors=1x Wire, Master or Slave
avrea.menu.wiremode.mors.build.wiremode=MORS_SINGLE
avrea.menu.wiremode.mors.build.wireabr=.wO
avrea.menu.wiremode.mands=1x Wire, Master and Slave
avrea.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
avrea.menu.wiremode.mands.build.wireabr=.wA

#-------------------------------------#
#         SPM from app mode           #
# To enable writing flash from app    #
#_____________________________________#
avrea.menu.appspm.no=Disabled (SPM write from app is not yet supported)
avrea.menu.appspm.no.bootloader.appspm=
avrea.menu.appspm.no.bootloader.BOOTSIZE=0x00
avrea.menu.appspm.no.build.appspmabr=
avrea.menu.appspm.full=These options don't work,
avrea.menu.appspm.full.bootloader.appspm=
avrea.menu.appspm.full.build.appspmabr=.spmINVALID
avrea.menu.appspm.full.bootloader.BOOTSIZE=0x00
#avrea.menu.appspm.full=Anywhere after 0x0200 (warning: App allowed to overwrite itself)
#avrea.menu.appspm.full.bootloader.appspm=-DSPM_FROM_APP=-1
#avrea.menu.appspm.full.build.appspmabr=.spmALL
#avrea.menu.appspm.8plus=Above 8k (meant for 16k parts)
#avrea.menu.appspm.8plus.bootloader.appspm=-DSPM_FROM_APP=32
#avrea.menu.appspm.8plus.bootloader.CODESIZE=32
#avrea.menu.appspm.12plus=Above 12k (meant for 16k parts)
#avrea.menu.appspm.12plus.bootloader.appspm=-DSPM_FROM_APP=48
#avrea.menu.appspm.12plus.bootloader.CODESIZE=48
#avrea.menu.appspm.14plus=Above 14k (meant for 16k parts)
#avrea.menu.appspm.14plus.bootloader.appspm=-DSPM_FROM_APP=56
#avrea.menu.appspm.14plus.bootloader.CODESIZE=56
#avrea.menu.appspm.16plus=Above 16k (AVR64/32 only, meant for 32k parts)
#avrea.menu.appspm.16plus.bootloader.appspm=-DSPM_FROM_APP=64
#avrea.menu.appspm.16plus.bootloader.CODESIZE=64
avrea.menu.appspm.24plus=but they have to be here for tests to run.
avrea.menu.appspm.24plus.bootloader.appspm=
#avrea.menu.appspm.24plus.bootloader.CODESIZE=96
#avrea.menu.appspm.28plus=Above 28k (AVR64/32 only, meant for 32k parts)
#avrea.menu.appspm.28plus.bootloader.appspm=-DSPM_FROM_APP=112
#avrea.menu.appspm.28plus.bootloader.CODESIZE=112
#avrea.menu.appspm.32plus=Above 32k (AVR64 only)
#avrea.menu.appspm.32plus.bootloader.appspm=-DSPM_FROM_APP=128
#avrea.menu.appspm.32plus.bootloader.CODESIZE=128
#avrea.menu.appspm.48plus=Above 48k (AVR64 only)
#avrea.menu.appspm.48plus.bootloader.appspm=-DSPM_FROM_APP=192
#avrea.menu.appspm.48plus.bootloader.CODESIZE=192
#avrea.menu.appspm.56plus=Above 56k (AVR64 only)
#avrea.menu.appspm.56plus.bootloader.appspm=-DSPM_FROM_APP=224
#avrea.menu.appspm.56plus.bootloader.CODESIZE=224
#avrea.menu.appspm.60plus=Above 60k (AVR64 only)
#avrea.menu.appspm.60plus.bootloader.appspm=-DSPM_FROM_APP=240
#avrea.menu.appspm.60plus.bootloader.CODESIZE=240

