SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# BrownOut detection (BOD) option        #
#________________________________________#
#    Completely speculative         #
#   Assumes same as Dx-series       #
#___________________________________#
avreb.menu.bodvoltage.1v75=1.75V (during programming only)
avreb.menu.bodvoltage.1v75.bootloader.bodlevbits=000
avreb.menu.bodvoltage.1v9=1.9V
avreb.menu.bodvoltage.1v9.bootloader.bodlevbits=001
avreb.menu.bodvoltage.2v6=2.60V
avreb.menu.bodvoltage.2v6.bootloader.bodlevbits=010
avreb.menu.bodvoltage.4v3=4.3V
avreb.menu.bodvoltage.4v3.bootloader.bodlevbits=011
avreb.menu.bodmode.disabled=Disabled/Disabled
avreb.menu.bodmode.enabled=Enabled/Enabled
avreb.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
avreb.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
avreb.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
avreb.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
avreb.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
avreb.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
avreb.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avreb.menu.bodmode.disabled.bootloader.BODCFG=0x00
avreb.menu.bodmode.enabled.bootloader.bodmodebits=00101
avreb.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avreb.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avreb.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avreb.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
avreb.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avreb.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avreb.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# Retain EEPROM (EESAVE)                 #
#________________________________________#
avreb.menu.eesave.enableenable=EEPROM + BOOTROW retained
avreb.menu.eesave.enableenable.bootloader.eesavebit=1
avreb.menu.eesave.enableenable.bootloader.browsavebit=1
avreb.menu.eesave.enabledisable=EEPROM retained, BOOTROW not
avreb.menu.eesave.enabledisable.bootloader.eesavebit=1
avreb.menu.eesave.enabledisable.bootloader.browsavebit=0
avreb.menu.eesave.disableenable=BOOTROW retained, EEPROM not
avreb.menu.eesave.disableenable.bootloader.eesavebit=0
avreb.menu.eesave.disableenable.bootloader.browsavebit=1
avreb.menu.eesave.disabledisable=Neither retained
avreb.menu.eesave.disabledisable.bootloader.eesavebit=0
avreb.menu.eesave.disabledisable.bootloader.browsavebit=0


#----------------------------------------#
# Reset pin as input option              #
#________________________________________#
avreb.menu.resetpin.reset=Hardware Reset (recommended)
avreb.menu.resetpin.reset.bootloader.resetpinbit=1
avreb.menu.resetpin.input=Input (no output, ever)
avreb.menu.resetpin.input.bootloader.resetpinbit=0

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
avreb.menu.millis.tcb1=TCB1 (recommended)
avreb.menu.millis.disabled=Disabled
avreb.menu.millis.tcb0=TCB0
#avreb.menu.millis.tce0=TCE0
#avreb.menu.millis.tcf3=TCF0
#avreb.menu.millis.rtc=RTC (no micros)
#avreb.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. xtal, no micros
#avreb.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. osc no micros
avreb.menu.millis.tcb0.build.millistimer=B0
avreb.menu.millis.tcb1.build.millistimer=B1
#avreb.menu.millis.tce0.build.millistimer=E0
#avreb.menu.millis.tcf0.build.millistimer=F0
#avreb.menu.millis.rtc.build.millistimer=RTC
#avreb.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
#avreb.menu.millis.rtcxosc.build.millistimer=RTC_XOSC
avreb.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
avreb.menu.printf.default=Default, 1.5k flash, no floats
avreb.menu.printf.full=Full, 2.6k, prints floats
avreb.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avreb.menu.printf.full.build.printfabr=.pfF
avreb.menu.printf.minimal=Minimal, 1.1k flash used
avreb.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avreb.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#avreb.menu.optimization.size=-Os (size)
#avreb.menu.optimization.sizegcse=-Os (size, no GCSE)
#avreb.menu.optimization.o3=-O3 (speed)
#avreb.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#avreb.menu.optimization.size.build.optimizationlevel=-Os
#avreb.menu.optimization.sizegcse.build.optimizationlevel=-Os
#avreb.menu.optimization.o3.build.optimizationlevel=-O3
#avreb.menu.optimization.o3gcse.build.optimizationlevel=-O3
#avreb.menu.optimization.size.build.optabr=.Os
#avreb.menu.optimization.sizegcse.build.optabr=.Osng
#avreb.menu.optimization.o3.build.optabr=.O3
#avreb.menu.optimization.o3gcse.build.optabr=.O3ng
#avreb.menu.optimization.sizegcse.build.gcse=-fno-gcse
#avreb.menu.optimization.o3gcse.build.gcse=-fno-gcse


#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
avreb.menu.attach.allenabled=On all pins, with new implementation.
avreb.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avreb.menu.attach.manual=Only enabled ports. Plebse see documentation.
avreb.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avreb.menu.attach.oldversion=Old version, may fix bugs.
avreb.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
avreb.menu.attach.manual.build.attachabr=.aMan
avreb.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# Startup time options                   #
#________________________________________#
avreb.menu.startuptime.8=8ms
avreb.menu.startuptime.0=0ms
avreb.menu.startuptime.1=1ms
avreb.menu.startuptime.2=2ms
avreb.menu.startuptime.4=4ms
avreb.menu.startuptime.16=16ms
avreb.menu.startuptime.32=32ms
avreb.menu.startuptime.64=64ms
avreb.menu.startuptime.0.bootloader.SYSCFG1=0x00
avreb.menu.startuptime.1.bootloader.SYSCFG1=0x01
avreb.menu.startuptime.2.bootloader.SYSCFG1=0x02
avreb.menu.startuptime.4.bootloader.SYSCFG1=0x03
avreb.menu.startuptime.8.bootloader.SYSCFG1=0x04
avreb.menu.startuptime.16.bootloader.SYSCFG1=0x05
avreb.menu.startuptime.32.bootloader.SYSCFG1=0x06
avreb.menu.startuptime.64.bootloader.SYSCFG1=0x07

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
avreb.menu.wiremode.mors=1x Wire, Master or Slave
avreb.menu.wiremode.mors.build.wiremode=MORS_SINGLE
avreb.menu.wiremode.mors.build.wireabr=.wO
avreb.menu.wiremode.mands=1x Wire, Master and Slave
avreb.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
avreb.menu.wiremode.mands.build.wireabr=.wA

#-------------------------------------#
#         SPM from app mode           #
# To enable writing flash from app    #
#_____________________________________#
avreb.menu.appspm.no=Disabled (SPM write from app is not yet supported)
avreb.menu.appspm.no.bootloader.appspm=
avreb.menu.appspm.no.bootloader.BOOTSIZE=0x00
avreb.menu.appspm.no.build.appspmabr=
avreb.menu.appspm.full=
avreb.menu.appspm.full.bootloader.appspm=
avreb.menu.appspm.full.build.appspmabr=.spmINVALID
avreb.menu.appspm.full.bootloader.BOOTSIZE=0x00
#avreb.menu.appspm.full=Anywhere after 0x0200 (warning: App allowed to overwrite itself)
#avreb.menu.appspm.full.bootloader.appspm=-DSPM_FROM_APP=-1
#avreb.menu.appspm.full.build.appspmabr=.spmALL
#avreb.menu.appspm.8plus=Above 8k (meant for 16k parts)
#avreb.menu.appspm.8plus.bootloader.appspm=-DSPM_FROM_APP=32
#avreb.menu.appspm.8plus.bootloader.CODESIZE=32
#avreb.menu.appspm.12plus=Above 12k (meant for 16k parts)
#avreb.menu.appspm.12plus.bootloader.appspm=-DSPM_FROM_APP=48
#avreb.menu.appspm.12plus.bootloader.CODESIZE=48
#avreb.menu.appspm.14plus=Above 14k (meant for 16k parts)
#avreb.menu.appspm.14plus.bootloader.appspm=-DSPM_FROM_APP=56
#avreb.menu.appspm.14plus.bootloader.CODESIZE=56
#avreb.menu.appspm.16plus=Above 16k (AVR64/32 only, meant for 32k parts)
#avreb.menu.appspm.16plus.bootloader.appspm=-DSPM_FROM_APP=64
#avreb.menu.appspm.16plus.bootloader.CODESIZE=64
#avreb.menu.appspm.24plus=Above 24k (AVR64/32 only, meant for 32k parts)
#avreb.menu.appspm.24plus.bootloader.appspm=-DSPM_FROM_APP=96
#avreb.menu.appspm.24plus.bootloader.CODESIZE=96
#avreb.menu.appspm.28plus=Above 28k (AVR64/32 only, meant for 32k parts)
#avreb.menu.appspm.28plus.bootloader.appspm=-DSPM_FROM_APP=112
#avreb.menu.appspm.28plus.bootloader.CODESIZE=112

