SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# BrownOut detection (BOD) options       #
#________________________________________#
avrdaopti.menu.bodvoltage.1v9=1.9V
avrdaopti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdaopti.menu.bodvoltage.2v45=2.45V
avrdaopti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdaopti.menu.bodvoltage.2v70=2.70V
avrdaopti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdaopti.menu.bodvoltage.2v85=2.85V
avrdaopti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdaopti.menu.bodmode.disabled=Disabled/Disabled
avrdaopti.menu.bodmode.enabled=Enabled/Enabled
avrdaopti.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
avrdaopti.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
avrdaopti.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
avrdaopti.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
avrdaopti.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
avrdaopti.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
avrdaopti.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrdaopti.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrdaopti.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrdaopti.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrdaopti.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrdaopti.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrdaopti.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
avrdaopti.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrdaopti.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrdaopti.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100


#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
avrdaopti.menu.millis.tcb2=TCB2 (recommended)
avrdaopti.menu.millis.disabled=Disabled (delay() only)
avrdaopti.menu.millis.tcb0=TCB0
avrdaopti.menu.millis.tcb1=TCB1
avrdaopti.menu.millis.tcb3=TCB3 (48/64-pin parts only)
avrdaopti.menu.millis.tcb4=TCB4 (64-pin parts only)
avrdaopti.menu.millis.tca0=TCA0
avrdaopti.menu.millis.tca1=TCA1 (48/64-pin parts only)
avrdaopti.menu.millis.tcb0.build.millistimer=B0
avrdaopti.menu.millis.tcb1.build.millistimer=B1
avrdaopti.menu.millis.tcb2.build.millistimer=B2
avrdaopti.menu.millis.tcb3.build.millistimer=B3
avrdaopti.menu.millis.tcb4.build.millistimer=B4
avrdaopti.menu.millis.tca0.build.millistimer=A0
avrdaopti.menu.millis.tca1.build.millistimer=A1
avrdaopti.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
avrdaopti.menu.printf.default=Default, 1.5k flash, no floats
avrdaopti.menu.printf.full=Full, 2.6k, prints floats
avrdaopti.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrdaopti.menu.printf.full.build.printfabr=.pfF
avrdaopti.menu.printf.minimal=Minimal, 1.1k flash used
avrdaopti.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrdaopti.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#avrdaopti.menu.optimization.size=-Os (size)
#avrdaopti.menu.optimization.sizegcse=-Os (size, no GCSE)
#avrdaopti.menu.optimization.o3=-O3 (speed)
#avrdaopti.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#avrdaopti.menu.optimization.size.build.optimizationlevel=-Os
#avrdaopti.menu.optimization.sizegcse.build.optimizationlevel=-Os
#avrdaopti.menu.optimization.o3.build.optimizationlevel=-O3
#avrdaopti.menu.optimization.o3gcse.build.optimizationlevel=-O3
#avrdaopti.menu.optimization.size.build.optabr=.Os
#avrdaopti.menu.optimization.sizegcse.build.optabr=.Osng
#avrdaopti.menu.optimization.o3.build.optabr=.O3
#avrdaopti.menu.optimization.o3gcse.build.optabr=.O3ng
#avrdaopti.menu.optimization.sizegcse.build.gcse=-fno-gcse
#avrdaopti.menu.optimization.o3gcse.build.gcse=-fno-gcse

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
avrdaopti.menu.attach.allenabled=On all pins, with new implementation.
avrdaopti.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avrdaopti.menu.attach.manual=Only enabled ports. Please see documentation.
avrdaopti.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avrdaopti.menu.attach.oldversion=Old version, (may fix bugs)
avrdaopti.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
avrdaopti.menu.attach.manual.build.attachabr=.aMan
avrdaopti.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# Startup time options                   #
#________________________________________#
avrdaopti.menu.startuptime.8=8ms
avrdaopti.menu.startuptime.0=0ms
avrdaopti.menu.startuptime.1=1ms
avrdaopti.menu.startuptime.2=2ms
avrdaopti.menu.startuptime.4=4ms
avrdaopti.menu.startuptime.16=16ms
avrdaopti.menu.startuptime.32=32ms
avrdaopti.menu.startuptime.64=64ms
avrdaopti.menu.startuptime.0.bootloader.SYSCFG1=0x00
avrdaopti.menu.startuptime.1.bootloader.SYSCFG1=0x01
avrdaopti.menu.startuptime.2.bootloader.SYSCFG1=0x02
avrdaopti.menu.startuptime.4.bootloader.SYSCFG1=0x03
avrdaopti.menu.startuptime.8.bootloader.SYSCFG1=0x04
avrdaopti.menu.startuptime.16.bootloader.SYSCFG1=0x05
avrdaopti.menu.startuptime.32.bootloader.SYSCFG1=0x06
avrdaopti.menu.startuptime.64.bootloader.SYSCFG1=0x07

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
avrdaopti.menu.wiremode.mors=1x Wire, Master or Slave (least Flash & RAM)
avrdaopti.menu.wiremode.mors.build.wiremode=MORS_SINGLE
avrdaopti.menu.wiremode.mors.build.wireabr=.wO
avrdaopti.menu.wiremode.mands=1x Wire, Master and Slave
avrdaopti.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
avrdaopti.menu.wiremode.mands.build.wireabr=.wA
avrdaopti.menu.wiremode.mors2=2x Wire, Master or Slave (>28 pin only)
avrdaopti.menu.wiremode.mors2.build.wiremode=MORS_BOTH
avrdaopti.menu.wiremode.mors2.build.wireabr=.wO2
avrdaopti.menu.wiremode.mands2=2x Wire, Master and Slave (>28 pin only)
avrdaopti.menu.wiremode.mands2.build.wiremode=MANDS_BOTH
avrdaopti.menu.wiremode.mands2.build.wireabr=.wA2



