SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
avrdbopti.bootloader.tool=avrdude
avrdbopti.bootloader.defaultentrycond=_extrf
avrdbopti.bootloader.entrycond={bootloader.defaultentrycond}
avrdbopti.bootloader.file={runtime.platform.path}/bootloaders/hex/{bootloader.class}{bootloader.port}{bootloader.entrycond}.hex
# AVR Dx-series can only take either 1 (unsupported, 32 kHz, too slow for serial, and 1/30th of the minimum speed we support) or 0 (normal operation)
avrdbopti.bootloader.OSCCFG=0b00000000
avrdbopti.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
avrdbopti.bootloader.wdtwindowbits=0000
avrdbopti.bootloader.wdttimeotbits=0000
avrdbopti.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrdbopti.bootloader.SYSCFG0=0b1100{bootloader.resetpinbit}000
avrdbopti.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
avrdbopti.bootloader.CODESIZE=0x00
avrdbopti.bootloader.BOOTSIZE=0x01
avrdbopti.bootloader.avrdudestring=-Uflash:w:{bootloader.file}:i
avrdbopti.bootloader.pymcuprogstring=-f "{bootloader.file}" -a write
avrdbopti.bootloader.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
avrdbopti.bootloader.serupdifuse5=5:{bootloader.SYSCFG0}
avrdbopti.program.serupdifuse5=5:{bootloader.SYSCFG0}
avrdbopti.program.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
#----------------------------------------#
# Upload parameters for Optiboot         #
#________________________________________#
avrdbopti.upload.tool=avrdude
avrdbopti.upload.protocol=arduino
avrdbopti.upload.extra_params=-D
avrdbopti.upload.speed=115200
avrdbopti.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards as it is guaranteed run correctly"

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
avrdbopti.build.mcupostfix=opti
avrdbopti.build.printfabr=
avrdbopti.build.flmapabr=.ful
avrdbopti.build.attachabr=
avrdbopti.build.wireabr=
avrdbopti.build.appspmabr=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DB submenu options                     #
#____________________________________________#
# Chip (memory and pincount)             #
#________________________________________#
avrdbopti.menu.chip.avr128db28=AVR128DB28
avrdbopti.menu.chip.avr128db28.build.mcu=avr128db28
avrdbopti.menu.chip.avr128db28.bootloader.class=optiboot_128dx
avrdbopti.menu.chip.avr128db28.upload.maximum_size=130560
avrdbopti.menu.chip.avr128db28.upload.maximum_data_size=16384
avrdbopti.menu.chip.avr128db28.build.variant=28pin-standard
avrdbopti.menu.chip.avr128db32=AVR128DB32
avrdbopti.menu.chip.avr128db32.build.mcu=avr128db32
avrdbopti.menu.chip.avr128db32.bootloader.class=optiboot_128dx
avrdbopti.menu.chip.avr128db32.upload.maximum_size=130560
avrdbopti.menu.chip.avr128db32.upload.maximum_data_size=16384
avrdbopti.menu.chip.avr128db32.build.variant=32pin-standard
avrdbopti.menu.chip.avr128db48=AVR128DB48
avrdbopti.menu.chip.avr128db48.build.mcu=avr128db48
avrdbopti.menu.chip.avr128db48.bootloader.class=optiboot_128dx
avrdbopti.menu.chip.avr128db48.upload.maximum_size=130560
avrdbopti.menu.chip.avr128db48.upload.maximum_data_size=16384
avrdbopti.menu.chip.avr128db48.build.variant=48pin-standard
avrdbopti.menu.chip.avr128db64=AVR128DB64
avrdbopti.menu.chip.avr128db64.build.mcu=avr128db64
avrdbopti.menu.chip.avr128db64.bootloader.class=optiboot_128dx
avrdbopti.menu.chip.avr128db64.upload.maximum_size=130560
avrdbopti.menu.chip.avr128db64.upload.maximum_data_size=16384
avrdbopti.menu.chip.avr128db64.build.variant=64pin-standard
avrdbopti.menu.chip.avr64db28=AVR64DB28
avrdbopti.menu.chip.avr64db28.build.mcu=avr64db28
avrdbopti.menu.chip.avr64db28.bootloader.class=optiboot_64dx
avrdbopti.menu.chip.avr64db28.upload.maximum_size=65024
avrdbopti.menu.chip.avr64db28.upload.maximum_data_size=8192
avrdbopti.menu.chip.avr64db28.build.variant=28pin-standard
avrdbopti.menu.chip.avr64db32=AVR64DB32
avrdbopti.menu.chip.avr64db32.build.mcu=avr64db32
avrdbopti.menu.chip.avr64db32.bootloader.class=optiboot_64dx
avrdbopti.menu.chip.avr64db32.upload.maximum_size=65024
avrdbopti.menu.chip.avr64db32.upload.maximum_data_size=8192
avrdbopti.menu.chip.avr64db32.build.variant=32pin-standard
avrdbopti.menu.chip.avr64db48=AVR64DB48
avrdbopti.menu.chip.avr64db48.build.mcu=avr64db48
avrdbopti.menu.chip.avr64db48.bootloader.class=optiboot_64dx
avrdbopti.menu.chip.avr64db48.upload.maximum_size=65024
avrdbopti.menu.chip.avr64db48.upload.maximum_data_size=8192
avrdbopti.menu.chip.avr64db48.build.variant=48pin-standard
avrdbopti.menu.chip.avr64db64=AVR64DB64
avrdbopti.menu.chip.avr64db64.build.mcu=avr64db64
avrdbopti.menu.chip.avr64db64.bootloader.class=optiboot_64dx
avrdbopti.menu.chip.avr64db64.upload.maximum_size=65024
avrdbopti.menu.chip.avr64db64.upload.maximum_data_size=8192
avrdbopti.menu.chip.avr64db64.build.variant=64pin-standard
avrdbopti.menu.chip.avr32db28=AVR32DB28
avrdbopti.menu.chip.avr32db28.build.mcu=avr32db28
avrdbopti.menu.chip.avr32db28.bootloader.class=optiboot_32dx
avrdbopti.menu.chip.avr32db28.upload.maximum_size=32256
avrdbopti.menu.chip.avr32db28.upload.maximum_data_size=4096
avrdbopti.menu.chip.avr32db28.build.variant=28pin-standard
avrdbopti.menu.chip.avr32db32=AVR32DB32
avrdbopti.menu.chip.avr32db32.build.mcu=avr32db32
avrdbopti.menu.chip.avr32db32.bootloader.class=optiboot_32dx
avrdbopti.menu.chip.avr32db32.upload.maximum_size=32256
avrdbopti.menu.chip.avr32db32.upload.maximum_data_size=4096
avrdbopti.menu.chip.avr32db32.build.variant=32pin-standard
avrdbopti.menu.chip.avr32db48=AVR32DB48
avrdbopti.menu.chip.avr32db48.build.mcu=avr32db48
avrdbopti.menu.chip.avr32db48.bootloader.class=optiboot_32dx
avrdbopti.menu.chip.avr32db48.upload.maximum_size=32256
avrdbopti.menu.chip.avr32db48.upload.maximum_data_size=4096
avrdbopti.menu.chip.avr32db48.build.variant=48pin-standard

