SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Reset pin as input option              #
#________________________________________#
avrdbopti.menu.resetpin.reset=PF6: Reset (default boot entry on reset pin & SW resets, 1 sec timeout)
avrdbopti.menu.resetpin.reset.bootloader.defaultentrycond=_extr
avrdbopti.menu.resetpin.reset.bootloader.resetpinbit=0
avrdbopti.menu.resetpin.input=PF6: Input (default boot entry on power on & SW resets, 8 sec timeout)
avrdbopti.menu.resetpin.input.bootloader.defaultentrycond=_all_8sec
avrdbopti.menu.resetpin.input.bootloader.resetpinbit=0

#----------------------------------------#
# Optiboot Entry Conditions              #
#________________________________________#
avrdbopti.menu.entrycond.default=Default (see documentation)
avrdbopti.menu.entrycond.extr=External (reset pin) (see documentation)
avrdbopti.menu.entrycond.extronly=External reset only (see documentation)
avrdbopti.menu.entrycond.all=Always (see documentation)
avrdbopti.menu.entrycond.poronly= Power On Only (see documentation)
avrdbopti.menu.entrycond.swr=SW-only: 8 second timeout (see documentation)
avrdbopti.menu.entrycond.extr_slow=External (reset pin), slow (see documentation)
avrdbopti.menu.entrycond.default.bootloader.entrycond={bootloader.defaultentrycond}
avrdbopti.menu.entrycond.extr.bootloader.entrycond=_extr
avrdbopti.menu.entrycond.extronly.bootloader.entrycond=_extronly
avrdbopti.menu.entrycond.poronly.bootloader.entrycond=_poronly_8sec
avrdbopti.menu.entrycond.all.bootloader.entrycond=_all_8sec
avrdbopti.menu.entrycond.swr.bootloader.entrycond=_swronly_8sec
avrdbopti.menu.entrycond.extr_slow.bootloader.entrycond=_extr_8sec

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
avrdbopti.menu.millis.tcb2=TCB2 (recommended)
avrdbopti.menu.millis.disabled=Disabled (delay() only)
avrdbopti.menu.millis.tcb0=TCB0
avrdbopti.menu.millis.tcb1=TCB1
avrdbopti.menu.millis.tcb3=TCB3 (48/64-pin parts only)
avrdbopti.menu.millis.tcb4=TCB4 (64-pin parts only)
avrdbopti.menu.millis.tca0=TCA0
avrdbopti.menu.millis.tca1=TCA1 (48/64-pin parts only)
avrdbopti.menu.millis.tcb0.build.millistimer=B0
avrdbopti.menu.millis.tcb1.build.millistimer=B1
avrdbopti.menu.millis.tcb2.build.millistimer=B2
avrdbopti.menu.millis.tcb3.build.millistimer=B3
avrdbopti.menu.millis.tcb4.build.millistimer=B4
avrdbopti.menu.millis.tca0.build.millistimer=A0
avrdbopti.menu.millis.tca1.build.millistimer=A1
avrdbopti.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
avrdbopti.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
avrdbopti.menu.printf.full=Full, 2.6k, prints floats
avrdbopti.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrdbopti.menu.printf.full.build.printfabr=.pfF
avrdbopti.menu.printf.minimal=Minimal, 1.1k flash used
avrdbopti.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrdbopti.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#avrdbopti.menu.optimization.size=-Os (size)
#avrdbopti.menu.optimization.sizegcse=-Os (size, no GCSE)
#avrdbopti.menu.optimization.o3=-O3 (speed)
#avrdbopti.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#avrdbopti.menu.optimization.size.build.optimizationlevel=-Os
#avrdbopti.menu.optimization.sizegcse.build.optimizationlevel=-Os
#avrdbopti.menu.optimization.o3.build.optimizationlevel=-O3
#avrdbopti.menu.optimization.o3gcse.build.optimizationlevel=-O3
#avrdbopti.menu.optimization.size.build.optabr=.Os
#avrdbopti.menu.optimization.sizegcse.build.optabr=.Osng
#avrdbopti.menu.optimization.o3.build.optabr=.O3
#avrdbopti.menu.optimization.o3gcse.build.optabr=.O3ng
#avrdbopti.menu.optimization.sizegcse.build.gcse=-fno-gcse
#avrdbopti.menu.optimization.o3gcse.build.gcse=-fno-gcse

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
avrdbopti.menu.attach.allenabled=On all pins, with new implementation.
avrdbopti.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avrdbopti.menu.attach.manual=Only enabled ports. Please see documentation.
avrdbopti.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avrdbopti.menu.attach.oldversion=Old version, (may fix bugs)
avrdbopti.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
avrdbopti.menu.attach.manual.build.attachabr=.aMan
avrdbopti.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# MVIO menu                              #
#________________________________________#
avrdbopti.menu.mvioopti.enabled=Enabled (burn bootloader req'd)
avrdbopti.menu.mvioopti.enabled.bootloader.mviobits=01
avrdbopti.menu.mvioopti.enabled.build.mvioenable=-DMVIO_ENABLED
avrdbopti.menu.mvioopti.disabled=Disabled (burn bootloader req'd)
avrdbopti.menu.mvioopti.disabled.bootloader.mviobits=10
avrdbopti.menu.mvioopti.disabled.build.mvioenable=
avrdbopti.menu.mvioopti.reallyenabled=Enabled. "burn bootloader" done for sure.
avrdbopti.menu.mvioopti.reallyenabled.bootloader.mviobits=01
avrdbopti.menu.mvioopti.reallyenabled.build.mvioenable=-DMVIO_ENABLED -DASSUME_MVIO_FUSE
avrdbopti.menu.mvioopti.reallydisabled=Disabled. "burn bootloader" done for sure.
avrdbopti.menu.mvioopti.reallydisabled.bootloader.mviobits=10
avrdbopti.menu.mvioopti.reallydisabled.build.mvioenable=-DASSUME_MVIO_FUSE

#----------------------------------------#
# Startup time options                   #
#________________________________________#
avrdbopti.menu.startuptime.8=8ms
avrdbopti.menu.startuptime.0=0ms
avrdbopti.menu.startuptime.1=1ms
avrdbopti.menu.startuptime.2=2ms
avrdbopti.menu.startuptime.4=4ms
avrdbopti.menu.startuptime.16=16ms
avrdbopti.menu.startuptime.32=32ms
avrdbopti.menu.startuptime.64=64ms
avrdbopti.menu.startuptime.0.bootloader.sutbits=000
avrdbopti.menu.startuptime.1.bootloader.sutbits=001
avrdbopti.menu.startuptime.2.bootloader.sutbits=010
avrdbopti.menu.startuptime.4.bootloader.sutbits=011
avrdbopti.menu.startuptime.8.bootloader.sutbits=100
avrdbopti.menu.startuptime.16.bootloader.sutbits=101
avrdbopti.menu.startuptime.32.bootloader.sutbits=110
avrdbopti.menu.startuptime.64.bootloader.sutbits=111

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
avrdbopti.menu.wiremode.mors=1x Wire, Master or Slave (least Flash & RAM)
avrdbopti.menu.wiremode.mors.build.wiremode=MORS_SINGLE
avrdbopti.menu.wiremode.mors.build.wireabr=.wO
avrdbopti.menu.wiremode.mands=1x Wire, Master and Slave
avrdbopti.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
avrdbopti.menu.wiremode.mands.build.wireabr=.wA
avrdbopti.menu.wiremode.mors2=2x Wire, Master or Slave (>28 pin only)
avrdbopti.menu.wiremode.mors2.build.wiremode=MORS_BOTH
avrdbopti.menu.wiremode.mors2.build.wireabr=.wO2
avrdbopti.menu.wiremode.mands2=2x Wire, Master and Slave (>28 pin only)
avrdbopti.menu.wiremode.mands2.build.wiremode=MANDS_BOTH
avrdbopti.menu.wiremode.mands2.build.wireabr=.wA2

