SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
azduinoboard.build.mcupostfix=opti
azduinoboard.build.printfabr=
azduinoboard.build.flmapabr=.ful
azduinoboard.build.attachabr=
azduinoboard.build.wireabr=
azduinoboard.build.appspmabr=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DB submenu options                     #
#____________________________________________#
# Chip (memory and pincount)             #
#________________________________________#
azduinoboard.menu.board.NanoDB_A=Azduino_NanoDB_RevA
azduinoboard.menu.board.NanoDB_A.build.board=Azduino_NanoDB_A
azduinoboard.menu.board.NanoDB_A.build.mcu=avr128db32
azduinoboard.menu.board.NanoDB_A.bootloader.class=optiboot_AzduinoNanoDB
azduinoboard.menu.board.NanoDB_A.upload.maximum_size=130560
azduinoboard.menu.board.NanoDB_A.upload.maximum_data_size=16384
azduinoboard.menu.board.NanoDB_A.build.variant=32pin-standard
azduinoboard.menu.board.NanoDB_A.bootloader.portname=Serial0
azduinoboard.menu.board.NanoDB_A.bootloader.portswap=1
azduinoboard.menu.board.NanoDB_A.build.extra_flags=-DMUX_DEFAULT_USART0=1  -DXTAL_PINS_HARDWIRED -DHARDWIRE_INPUT_ONLY=PIN_PA5 -DLED_BUILTIN2=PIN_PA6 -DUSING_OPTIBOOT {build.mvioenable}
azduinoboard.menu.board.NanoDB_A.build.variant=32pin-standard
azduinoboard.menu.board.NanoDD_A=Azduino_NanoDD_RevA
azduinoboard.menu.board.NanoDD_A.build.board=Azduino_NanoDD_A
azduinoboard.menu.board.NanoDD_A.build.mcu=avr64dd32
azduinoboard.menu.board.NanoDD_A.bootloader.class=optiboot_AzduinoNanoDD
azduinoboard.menu.board.NanoDD_A.upload.maximum_size=65024
azduinoboard.menu.board.NanoDD_A.upload.maximum_data_size=8192
azduinoboard.menu.board.NanoDB_A.build.variant=32pin-ddseries
azduinoboard.menu.board.NanoDD_A.bootloader.portname=Serial0
azduinoboard.menu.board.NanoDD_A.bootloader.portswap=1
azduinoboard.menu.board.NanoDD_A.bootloader.muxnum=1
azduinoboard.menu.board.NanoDD_A.build.extra_flags=-DMUX_DEFAULT_USART0=1  -DXTAL_PINS_HARDWIRED -DHARDWIRE_INPUT_ONLY=PIN_PA5 -DLED_BUILTIN2=PIN_PA6 -DUSING_OPTIBOOT {build.mvioenable}
azduinoboard.menu.board.NanoDD_A.build.variant=32pin-ddseries
#azduinoboard.menu.board.NanoDB_B=Azduino Nano DB (Rev. B or A w/resistor mod)
#azduinoboard.menu.board.NanoDB_B.build.mcu=NanoDB_B
#azduinoboard.menu.board.NanoDB_B.bootloader.class=optiboot_128dx
#azduinoboard.menu.board.NanoDB_B.upload.maximum_size=130560
#azduinoboard.menu.board.NanoDB_B.upload.maximum_data_size=16384
#azduinoboard.menu.board.NanoDB_B.bootloader.portname=Serial0
#azduinoboard.menu.board.NanoDB_B.bootloader.portswap=1
#azduinoboard.menu.board.NanoDB_B.build.extra_flags=-DMUX_DEFAULT_USART0=1  -DXTAL_PINS_HARDWIRED -DLED_BUILTIN2=PIN_PA6 -DUSING_OPTIBOOT {build.mvioenable}
#azduinoboard.menu.board.NanoDB_B.build.variant=32pin-standard
azduinoboard.menu.board.LEDCTRLA.build.extra_flags=-DMUX_DEFAULT_USART0=1 -DXTAL_PINS_HARDWIRED -DLED_BUILTIN2=PIN_PF0 -DLED_BUILTIN3=PIN_PF1 -DUSING_OPTIBOOT {build.mvioenable}
azduinoboard.menu.board.LEDCTRLA=LEDCTRLA Light Controller 2.1+
azduinoboard.menu.board.LEDCTRLA=AzduinoLEDCTRLA
azduinoboard.menu.board.LEDCTRLA.build.mcu=avr128db48
azduinoboard.menu.board.LEDCTRLA.bootloader.class=optiboot_AzduinoLEDCTRLA
azduinoboard.menu.board.LEDCTRLA.upload.maximum_size=130560
azduinoboard.menu.board.LEDCTRLA.upload.maximum_data_size=16384
azduinoboard.menu.board.LEDCTRLA.build.variant=48pin-standard
azduinoboard.menu.board.NanoDBplus.build.extra_flags=-DMUX_DEFAULT_USART0=1 -DXTAL_PINS_HARDWIRED -DLED_BUILTIN2=PIN_PF0 -DLED_BUILTIN3=PIN_PF1 -DUSING_OPTIBOOT {build.mvioenable}
azduinoboard.menu.board.NanoDBplus=Azduino NanoDB+ (128DB48)
azduinoboard.menu.board.NanoDBplus.build.mcu=avr128db48
azduinoboard.menu.board.NanoDBplus.bootloader.class=optiboot_AzduinoNanoDBPlus
azduinoboard.menu.board.NanoDBplus.bootloader.portswap=1
azduinoboard.menu.board.NanoDBplus.bootloader.portname=Serial0
azduinoboard.menu.board.NanoDBplus.upload.maximum_size=130560
azduinoboard.menu.board.NanoDBplus.upload.maximum_data_size=16384
azduinoboard.menu.board.NanoDBplus.build.variant=48pin-standard
#----------------------------------------#
# Clock speed and source options         #
# For the Azduino products we drop clock #
# speeds we think are unlikely to see    #
# use. These ship with 16-48 (!!) MHz    #
#________________________________________#
azduinoboard.menu.clock.24internal=24 MHz internal
azduinoboard.menu.clock.24internal.build.speed=24
azduinoboard.menu.clock.24internal.build.clocksource=0
azduinoboard.menu.clock.20internal=20 MHz internal
azduinoboard.menu.clock.20internal.build.speed=20
azduinoboard.menu.clock.20internal.build.clocksource=0
azduinoboard.menu.clock.16internal=16 MHz internal
azduinoboard.menu.clock.16internal.build.speed=16
azduinoboard.menu.clock.16internal.build.clocksource=0
azduinoboard.menu.clock.24crystal=24 MHz crystal
azduinoboard.menu.clock.24crystal.build.speed=24
azduinoboard.menu.clock.24crystal.build.clocksource=1
azduinoboard.menu.clock.20crystal=20 MHz crystal
azduinoboard.menu.clock.20crystal.build.speed=20
azduinoboard.menu.clock.20crystal.build.clocksource=1
azduinoboard.menu.clock.16crystal=16 MHz crystal
azduinoboard.menu.clock.16crystal.build.speed=16
azduinoboard.menu.clock.16crystal.build.clocksource=1
azduinoboard.menu.clock.32crystal=32 MHz crystal (overclocked)
azduinoboard.menu.clock.32crystal.build.speed=32
azduinoboard.menu.clock.32crystal.build.clocksource=1
azduinoboard.menu.clock.40crystal=40 MHz crystal (highly overclocked)
azduinoboard.menu.clock.40crystal.build.speed=40
azduinoboard.menu.clock.40crystal.build.clocksource=1
azduinoboard.menu.clock.32internal=32 MHz internal (overclocked)
azduinoboard.menu.clock.32internal.build.speed=32
azduinoboard.menu.clock.32internal.build.clocksource=0
azduinoboard.menu.clock.4internal=4 MHz internal
azduinoboard.menu.clock.4internal.build.speed=4
azduinoboard.menu.clock.4internal.build.clocksource=0
azduinoboard.menu.clock.1internal=1 MHz internal
azduinoboard.menu.clock.1internal.build.speed=1
azduinoboard.menu.clock.1internal.build.clocksource=0
azduinoboard.menu.clock.30crystal=30 MHz crystal (overclocked)
azduinoboard.menu.clock.30crystal.build.speed=30
azduinoboard.menu.clock.30crystal.build.clocksource=1
azduinoboard.menu.clock.48crystal=48 MHz crystal (are you nuts?!)
azduinoboard.menu.clock.48crystal.build.speed=48
azduinoboard.menu.clock.48crystal.build.clocksource=1

